Catalogs/PropertySets.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>PropertySets</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Content</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalPropertiesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/PropertySets/Ext/ObjectModule.bsl
Procedure OnWrite(Cancel)
	
	If ValueIsFilled(Parent) Then
		MainObject = Parent.GetObject();
		MainObject.Write();
	EndIf;

EndProcedure

Procedure BeforeWrite(Cancel)

	If NOT IsFolder Then
		
		// Delete doubles and empty strings
		mapSelected = New Map;
		arrayDelete = New Array;
		
		For each Row In Content Do
			If Row.Property.IsEmpty() OR mapSelected.Get(Row.Property) <> Undefined Then
				arrayDelete.Add(Row);
			Else
				mapSelected.Insert(Row.Property, True);
			EndIf;
		EndDo;
		
		For each Row In arrayDelete Do
			mapSelected.Delete(Row);
		EndDo;
		
	ElsIf Predefined Then
		
		// Gather all linked to root lists
		
		Query = New Query;
		Query.Text =
		"SELECT DISTINCT
		|	PropertySetsContent.Property
		|FROM
		|	Catalog.PropertySets.Content AS PropertySetsContent
		|WHERE
		|	PropertySetsContent.Ref.Parent = &Parent";
		
		Query.SetParameter("Parent", Ref);
		
		TableProperties = Query.Execute().Unload();
		Content.Load(TableProperties);
		
	EndIf;
	
EndProcedure
